Дошкольное_учреждение83/src/Catalogs/ГруппыДоступаИсполнителей/ГруппыДоступаИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступаИсполнителей</name>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ГруппыДоступаИсполнителей/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ЗначениеЗаполнено(РольИсполнителя) Тогда
		
		Наименование = Строка(РольИсполнителя);
		
		Если ЗначениеЗаполнено(ОсновнойОбъектАдресации) Тогда
			Наименование = Наименование + ", " + Строка(ОсновнойОбъектАдресации);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДополнительныйОбъектАдресации) Тогда
			Наименование = Наименование + ", " + Строка(ДополнительныйОбъектАдресации);
		КонецЕсли;
	Иначе
		Наименование = "<Без ролевой адресации>";
	КонецЕсли;
	
	// Проверка дубля.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыДоступаИсполнителей.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступаИсполнителей КАК ГруппыДоступаИсполнителей
	|ГДЕ
	|	ГруппыДоступаИсполнителей.РольИсполнителя = &РольИсполнителя
	|	И ГруппыДоступаИсполнителей.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации
	|	И ГруппыДоступаИсполнителей.ДополнительныйОбъектАдресации = &ДополнительныйОбъектАдресации
	|	И ГруппыДоступаИсполнителей.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителя);
	Запрос.УстановитьПараметр("ОсновнойОбъектАдресации", ОсновнойОбъектАдресации);
	Запрос.УстановитьПараметр("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Уже есть группа доступа исполнителей для которой
			           |Роль исполнителя = ""%1""
			           |Основной объект адресации = ""%2""
			           |Дополнительный объект адресации = ""%3""'"),
			Строка(РольИсполнителя),
			Строка(ОсновнойОбъектАдресации),
			Строка(ДополнительныйОбъектАдресации)));
	КонецЕсли;
	
КонецПроцедуры
